Revit 2027 API
FabricationServiceButton.IsValidConditionIndex Method
 Validates if the given condition index is valid or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidConditionIndex(
	FabricationServiceButton button,
	int condition
)
Public Shared Function IsValidConditionIndex (
	button As FabricationServiceButton,
	condition As Integer
) As Boolean
public:
static bool IsValidConditionIndex(
	FabricationServiceButton^ button,
	int condition
)
static member IsValidConditionIndex :
        button : FabricationServiceButton *
        condition : int -> bool
Parameters
button FabricationServiceButton
 The button to check.
condition Int32
 The condition index.
Return Value
Boolean
 True if larger or equal to 0 and less than ConditionCount.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace